Autodesk.Revit.DB.SpatialElementGeometryResults.GetBoundaryFaceInfo(Autodesk.Revit.DB.Face)
Query the spatial element boundary face information with the given face.
face:
The face from the spatial element's geometry.
Returns:
Sub-faces related to the room bounding elements that define the spatial element face. Returns null if there is no corresponding boundary information with the given face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012